[
  {
    "id": 12,
    "image": "../src/assets/1.jpg",
    "title": "ChatMate AI Assistant",
    "companyName": "NextGen Softworks",
    "description": "ChatMate AI Assistant is a highly intelligent and intuitive AI companion designed to assist users in managing their daily tasks, answering complex questions, composing emails, summarizing documents, and providing real-time suggestions. With a focus on delivering seamless interaction, it leverages cutting-edge AI algorithms and natural language processing to ensure accurate and helpful responses. Whether for professional or personal use, ChatMate enhances productivity, helps organize schedules, and provides a smart assistant that adapts to your preferences. It can handle multi-step queries, generate creative content, and offer educational insights. Ideal for students, professionals, and anyone seeking a smarter way to navigate their digital life, ChatMate AI Assistant ensures efficiency, reliability, and convenience. With frequent updates and improvements, it continues to learn and evolve, offering a unique blend of technology and user-centric design.",
    "size": 85,
    "reviews": "12.5k",
    "ratingAvg": 4.8,
    "downloads": "1.2M",
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 500 },
      { "name": "3 star", "count": 800 },
      { "name": "4 star", "count": 2200 },
      { "name": "5 star", "count": 9700 }
    ]
  },
  {
    "id": 1,
    "image": "../src/assets/2.jpg",
    "title": "FitTrack Pro",
    "companyName": "BodyTech Labs",
    "description": "FitTrack Pro is a comprehensive health and fitness application that tracks your heart rate, steps, calories burned, sleep patterns, and overall wellness. It offers personalized fitness plans, daily reminders, and real-time data synchronization to help users achieve their fitness goals efficiently. The app includes intelligent insights, progress tracking, goal setting, and interactive charts to monitor performance. With its sleek design and intuitive interface, FitTrack Pro motivates users to maintain a healthy lifestyle by providing actionable recommendations and feedback. Perfect for beginners and fitness enthusiasts, it combines technology, analytics, and user-centric design to promote holistic well-being and productivity.",
    "size": 72,
    "reviews": "9.8k",
    "ratingAvg": 4.6,
    "downloads": "850k",
    "ratings": [
      { "name": "1 star", "count": 250 },
      { "name": "2 star", "count": 430 },
      { "name": "3 star", "count": 920 },
      { "name": "4 star", "count": 2100 },
      { "name": "5 star", "count": 6100 }
    ]
  },
  {
    "id": 5,
    "image": "../src/assets/3.jpg",
    "title": "PicPerfect Editor",
    "companyName": "Visionary Studios",
    "description": "PicPerfect Editor is an advanced photo editing application designed for both amateurs and professionals. It offers AI-powered background removal, beauty retouch, collage making, and high-quality filters to enhance images effortlessly. Users can easily crop, adjust colors, apply effects, and create stunning visual content. The app integrates intelligent tools that simplify complex editing tasks while maintaining full creative control. PicPerfect Editor focuses on user-friendly workflows, seamless sharing, and professional-grade results, making it ideal for social media creators, photographers, and enthusiasts. It combines efficiency, creativity, and cutting-edge technology to deliver superior photo editing experience every time.",
    "size": 108,
    "reviews": "15.6k",
    "ratingAvg": 4.7,
    "downloads": "2.1M",
    "ratings": [
      { "name": "1 star", "count": 500 },
      { "name": "2 star", "count": 700 },
      { "name": "3 star", "count": 1200 },
      { "name": "4 star", "count": 2600 },
      { "name": "5 star", "count": 10200 }
    ]
  },
  {
    "id": 4,
    "image": "../src/assets/4.jpg",
    "title": "StudyMaster AI",
    "companyName": "EduCore Solutions",
    "description": "StudyMaster AI is an innovative educational tool that assists students in learning and exam preparation. Utilizing AI algorithms, it provides personalized notes, practice questions, flashcards, and performance analysis. The app identifies weak areas, offers targeted recommendations, and tracks improvement over time. It encourages active learning through interactive content, adaptive quizzes, and smart study reminders. StudyMaster AI ensures students stay organized, motivated, and effective in their studies. Suitable for all levels of learners, it combines technology, pedagogy, and user-centered design to improve knowledge retention and academic performance efficiently.",
    "size": 64,
    "reviews": "8.8k",
    "ratingAvg": 4.5,
    "downloads": "940k",
    "ratings": [
      { "name": "1 star", "count": 320 },
      { "name": "2 star", "count": 490 },
      { "name": "3 star", "count": 1020 },
      { "name": "4 star", "count": 2200 },
      { "name": "5 star", "count": 4770 }
    ]
  },
  {
    "id": 13,
    "image": "../src/assets/5.jpg",
    "title": "TravelGo Explorer",
    "companyName": "WanderWorks Inc.",
    "description": "TravelGo Explorer is a complete travel companion app providing users with real-time information about destinations, flights, hotels, and itineraries. With AI-powered recommendations, it suggests hidden gems, local attractions, and personalized travel plans. Users can easily plan trips, book accommodations, and monitor travel schedules. The app provides interactive maps, safety tips, and alerts to ensure smooth journeys. TravelGo Explorer enhances the travel experience by combining convenience, intelligence, and engaging content, allowing travelers to discover new places efficiently and enjoyably.",
    "size": 93,
    "reviews": "6.7k",
    "ratingAvg": 4.4,
    "downloads": "700k",
    "ratings": [
      { "name": "1 star", "count": 210 },
      { "name": "2 star", "count": 350 },
      { "name": "3 star", "count": 870 },
      { "name": "4 star", "count": 2000 },
      { "name": "5 star", "count": 4370 }
    ]
  },
  {
    "id": 6,
    "image": "../src/assets/6.jpg",
    "title": "MusicFy Player",
    "companyName": "SoundWave Media",
    "description": "MusicFy Player is a next-generation music streaming app that allows users to enjoy high-quality audio, create custom playlists, and download songs for offline listening. Featuring an intuitive interface, equalizer settings, and AI-generated recommendations, it personalizes music discovery for every user. The app also supports social sharing, collaborative playlists, and live lyrics for an immersive experience. With seamless integration across devices and high-speed playback, MusicFy ensures users can enjoy uninterrupted, personalized music anywhere. Its powerful AI engine learns listening habits, offering curated suggestions to match mood, activity, or preference. MusicFy Player combines cutting-edge technology with a user-friendly design to redefine music streaming and discovery.",
    "size": 95,
    "reviews": "13.2k",
    "ratingAvg": 4.8,
    "downloads": "1.8M",
    "ratings": [
      { "name": "1 star", "count": 200 },
      { "name": "2 star", "count": 400 },
      { "name": "3 star", "count": 900 },
      { "name": "4 star", "count": 2800 },
      { "name": "5 star", "count": 10800 }
    ]
  },
  {
    "id": 7,
    "image": "../src/assets/7.jpg",
    "title": "NewsZone 24x7",
    "companyName": "InfoStream Network",
    "description": "NewsZone 24x7 delivers the latest breaking news, trending stories, and live updates from around the world. It provides a customizable news feed, offline reading mode, and category filters to ensure readers get relevant information instantly. The app includes real-time notifications, curated highlights, and interactive media content to enhance the news consumption experience. With a focus on speed, reliability, and accuracy, NewsZone 24x7 ensures users stay informed anytime, anywhere. Its AI-powered algorithms also suggest related articles and trending topics based on user interests, combining modern technology and journalism for a comprehensive news platform.",
    "size": 51,
    "reviews": "4.6k",
    "ratingAvg": 4.3,
    "downloads": "600k",
    "ratings": [
      { "name": "1 star", "count": 180 },
      { "name": "2 star", "count": 290 },
      { "name": "3 star", "count": 710 },
      { "name": "4 star", "count": 1600 },
      { "name": "5 star", "count": 1820 }
    ]
  },
  {
    "id": 8,
    "image": "../src/assets/8.jpg",
    "title": "ShopZone Online",
    "companyName": "MegaCart Ltd.",
    "description": "ShopZone Online is a comprehensive e-commerce platform that offers millions of products across electronics, fashion, groceries, and more. It provides fast delivery, secure payments, personalized recommendations, and 24/7 customer support. Users can browse categories, filter items, compare products, and access exclusive deals and discounts. The app features smart search, wish lists, and an intuitive interface to enhance the shopping experience. ShopZone Online integrates loyalty programs, push notifications, and order tracking, ensuring a seamless and convenient shopping experience. Perfect for tech-savvy shoppers and bargain hunters alike, it combines efficiency, accessibility, and user-centric design.",
    "size": 120,
    "reviews": "24.2k",
    "ratingAvg": 4.6,
    "downloads": "3.5M",
    "ratings": [
      { "name": "1 star", "count": 700 },
      { "name": "2 star", "count": 1000 },
      { "name": "3 star", "count": 2300 },
      { "name": "4 star", "count": 5600 },
      { "name": "5 star", "count": 14600 }
    ]
  },
  {
    "id": 9,
    "image": "../src/assets/9.jpg",
    "title": "FinTrack Wallet",
    "companyName": "SmartPay Systems",
    "description": "FinTrack Wallet is an advanced financial management application designed to help users monitor expenses, set budgets, track spending habits, and receive actionable insights. With secure UPI and bank transfer support, the app ensures safe transactions and easy money management. Users can categorize expenses, view interactive charts, and get personalized recommendations to optimize finances. Its intuitive interface simplifies financial planning while offering alerts, reminders, and analytical tools. FinTrack Wallet is perfect for individuals seeking a smarter, organized, and secure way to handle personal finances effectively.",
    "size": 68,
    "reviews": "7.5k",
    "ratingAvg": 4.5,
    "downloads": "900k",
    "ratings": [
      { "name": "1 star", "count": 240 },
      { "name": "2 star", "count": 420 },
      { "name": "3 star", "count": 800 },
      { "name": "4 star", "count": 2100 },
      { "name": "5 star", "count": 3940 }
    ]
  },
  {
    "id": 10,
    "image": "../src/assets/10.jpg",
    "title": "CameraX Pro",
    "companyName": "PixelPro Labs",
    "description": "CameraX Pro transforms your smartphone into a professional-grade camera. The app provides advanced features like manual controls, RAW support, AI-enhanced photography, cinematic video capture, and lighting adjustments. It enables users to take stunning photos and videos with precision and creativity. CameraX Pro includes smart scene detection, real-time filters, and intuitive editing tools to enhance images immediately after capture. Designed for photographers, content creators, and enthusiasts, it combines technical depth with simplicity, offering professional results in a mobile-friendly interface. It supports sharing to social media, cloud backup, and batch editing, ensuring a seamless photography workflow.",
    "size": 99,
    "reviews": "16.5k",
    "ratingAvg": 4.7,
    "downloads": "2.5M",
    "ratings": [
      { "name": "1 star", "count": 400 },
      { "name": "2 star", "count": 600 },
      { "name": "3 star", "count": 1000 },
      { "name": "4 star", "count": 2900 },
      { "name": "5 star", "count": 11600 }
    ]
  },
  {
    "id": 11,
    "image": "../src/assets/11.jpg",
    "title": "TaskFlow Manager",
    "companyName": "FlowByte Technologies",
    "description": "TaskFlow Manager is a productivity and project management application that helps teams and individuals organize tasks efficiently. It provides Kanban boards, reminders, analytics, and collaboration tools to streamline workflows. Users can track project progress, assign tasks, set deadlines, and receive notifications for timely completion. TaskFlow Manager offers performance insights, priority setting, and reporting features to improve efficiency. The app integrates seamlessly across devices, ensuring that teams stay synchronized and productive. Designed for modern work environments, TaskFlow Manager combines robust functionality with an easy-to-use interface, enabling users to manage work smarter and achieve goals effectively.",
    "size": 81,
    "reviews": "9.8k",
    "ratingAvg": 4.6,
    "downloads": "1.1M",
    "ratings": [
      { "name": "1 star", "count": 260 },
      { "name": "2 star", "count": 420 },
      { "name": "3 star", "count": 900 },
      { "name": "4 star", "count": 2400 },
      { "name": "5 star", "count": 5820 }
    ]
  },
  {
    "id": 2,
    "image": "../src/assets/12.jpg",
    "title": "LearnHub Courses",
    "companyName": "SkillBoost Co.",
    "description": "LearnHub Courses offers thousands of online courses spanning programming, design, marketing, and personal development. It provides lifetime access, progress tracking, and interactive learning tools to help users gain skills effectively. The app features video tutorials, quizzes, assignments, and community discussion forums to enhance the learning experience. Users can personalize their study plan, receive certifications, and access expert guidance from industry professionals. LearnHub Courses focuses on user engagement, skill mastery, and continuous improvement. Its AI-driven recommendations suggest courses based on learning habits, making skill development both efficient and enjoyable. Perfect for learners of all ages, it empowers knowledge acquisition and career growth.",
    "size": 105,
    "reviews": "14.2k",
    "ratingAvg": 4.7,
    "downloads": "1.9M",
    "ratings": [
      { "name": "1 star", "count": 380 },
      { "name": "2 star", "count": 560 },
      { "name": "3 star", "count": 1100 },
      { "name": "4 star", "count": 2700 },
      { "name": "5 star", "count": 9460 }
    ]
  },
  {
    "id": 3,
    "image": "../src/assets/13.jpg",
    "title": "GameArena Hub",
    "companyName": "PixelPlay Studios",
    "description": "GameArena Hub is a comprehensive platform for mobile gaming enthusiasts. It allows users to discover, download, review, and play games efficiently. The app features personalized recommendations, leaderboards, achievements, and in-game rewards. GameArena Hub provides news, updates, and tips about popular games, ensuring players stay ahead. Users can participate in community discussions, share content, and track their progress. Designed for gamers of all levels, it offers a seamless experience, combining discovery, engagement, and performance tracking. Its intuitive interface and AI-based suggestions ensure users get a personalized gaming journey every time.",
    "size": 115,
    "reviews": "16.8k",
    "ratingAvg": 4.8,
    "downloads": "2.7M",
    "ratings": [
      { "name": "1 star", "count": 400 },
      { "name": "2 star", "count": 700 },
      { "name": "3 star", "count": 1100 },
      { "name": "4 star", "count": 2900 },
      { "name": "5 star", "count": 11600 }
    ]
  },
  {
    "id": 14,
    "image": "../src/assets/14.jpg",
    "title": "Weatherly Now",
    "companyName": "SkyData Corp.",
    "description": "Weatherly Now provides hyper-accurate weather forecasts, live radar updates, and air quality information in real-time. The app uses AI-powered algorithms to predict weather changes, track storms, and suggest precautions. Users receive notifications for severe weather alerts, hourly updates, and personalized recommendations. Weatherly Now offers interactive maps, climate insights, and historical data for informed planning. Its user-friendly interface allows easy access to detailed weather information, ensuring safety and preparedness. Ideal for commuters, travelers, and outdoor enthusiasts, Weatherly Now combines data accuracy, real-time alerts, and smart visualization to make weather monitoring effortless and reliable.",
    "size": 58,
    "reviews": "6.2k",
    "ratingAvg": 4.4,
    "downloads": "780k",
    "ratings": [
      { "name": "1 star", "count": 230 },
      { "name": "2 star", "count": 360 },
      { "name": "3 star", "count": 890 },
      { "name": "4 star", "count": 2000 },
      { "name": "5 star", "count": 2720 }
    ]
  },
  {
    "id": 15,
    "image": "../src/assets/15.jpg",
    "title": "SecureVault Password Manager",
    "companyName": "CyberTrust Apps",
    "description": "SecureVault Password Manager helps users store, generate, and manage passwords securely. With advanced AES-256 encryption, the app ensures that login credentials are safe across devices. Features include password auto-fill, biometric authentication, security alerts, and password strength analysis. Users can organize credentials, generate strong passwords, and receive suggestions for updating weak passwords. SecureVault provides cloud synchronization, multi-device support, and offline access to passwords. Ideal for both personal and professional use, it emphasizes safety, convenience, and efficiency. Its intuitive interface simplifies security management, while frequent updates ensure robust protection against evolving cyber threats.",
    "size": 63,
    "reviews": "8.7k",
    "ratingAvg": 4.6,
    "downloads": "950k",
    "ratings": [
      { "name": "1 star", "count": 210 },
      { "name": "2 star", "count": 340 },
      { "name": "3 star", "count": 820 },
      { "name": "4 star", "count": 2100 },
      { "name": "5 star", "count": 5230 }
    ]
  },
  {
    "id": 16,
    "image": "../src/assets/16.jpeg",
    "title": "MindSpace Notes",
    "companyName": "BrainySoft Inc.",
    "description": "MindSpace Notes is an AI-driven note-taking and organization app designed to help users capture ideas, tasks, and projects efficiently. It offers smart categorization, tagging, search, reminders, and synchronization across devices. Users can create rich-text notes, attach media files, and share notes with collaborators. MindSpace Notes uses AI to summarize content, suggest priorities, and provide actionable insights. Ideal for students, professionals, and creatives, the app enhances productivity, ensures organization, and fosters collaboration. Its intuitive interface and intelligent features make managing information seamless and efficient.",
    "size": 55,
    "reviews": "5.8k",
    "ratingAvg": 4.5,
    "downloads": "620k",
    "ratings": [
      { "name": "1 star", "count": 150 },
      { "name": "2 star", "count": 250 },
      { "name": "3 star", "count": 550 },
      { "name": "4 star", "count": 1800 },
      { "name": "5 star", "count": 3000 }
    ]
  },
  {
    "id": 17,
    "image": "../src/assets/17.jpg",
    "title": "QuickFit Coach",
    "companyName": "HealthWave Labs",
    "description": "QuickFit Coach is a personalized fitness app offering AI-guided workouts, nutrition plans, and progress tracking. Users can set goals, monitor performance, and receive tailored recommendations. The app features video tutorials, interactive challenges, and adaptive training plans. QuickFit Coach analyzes user activity, adjusts intensity, and provides feedback to optimize fitness routines. Ideal for beginners and advanced athletes, it combines technology, analytics, and motivation to help users stay healthy, improve stamina, and achieve fitness objectives efficiently. Its interface is intuitive, making fitness management simple, engaging, and effective.",
    "size": 70,
    "reviews": "7.1k",
    "ratingAvg": 4.6,
    "downloads": "780k",
    "ratings": [
      { "name": "1 star", "count": 180 },
      { "name": "2 star", "count": 300 },
      { "name": "3 star", "count": 650 },
      { "name": "4 star", "count": 2100 },
      { "name": "5 star", "count": 3650 }
    ]
  },
  {
    "id": 18,
    "image": "../src/assets/18.jpg",
    "title": "Eventify Planner",
    "companyName": "PlanIt Co.",
    "description": "Eventify Planner is an all-in-one event management application that helps users plan, schedule, and manage events efficiently. It provides features such as guest management, invitations, reminders, RSVPs, calendar synchronization, and detailed analytics. Users can create personalized event layouts, send notifications, and track attendance in real time. Eventify Planner also integrates with popular calendars and messaging platforms for seamless coordination. Its intuitive interface ensures effortless navigation, while intelligent suggestions help optimize planning. Ideal for personal, corporate, or social events, Eventify Planner combines functionality, organization, and convenience for a successful event management experience.",
    "size": 60,
    "reviews": "4.9k",
    "ratingAvg": 4.4,
    "downloads": "540k",
    "ratings": [
      { "name": "1 star", "count": 120 },
      { "name": "2 star", "count": 200 },
      { "name": "3 star", "count": 450 },
      { "name": "4 star", "count": 1500 },
      { "name": "5 star", "count": 2750 }
    ]
  },
  {
    "id": 19,
    "image": "../src/assets/19.jpg",
    "title": "CryptoTracker Pro",
    "companyName": "FinTech Solutions",
    "description": "CryptoTracker Pro is a powerful cryptocurrency monitoring app that provides users with real-time prices, trends, portfolio management, and AI-driven insights. It supports multiple cryptocurrencies, exchanges, and wallets. Users can track investments, receive alerts, analyze market trends, and make informed decisions. CryptoTracker Pro offers detailed charts, historical data, news updates, and risk management tools. Designed for both beginners and experienced traders, it ensures security, accuracy, and convenience. With its intuitive interface, interactive dashboards, and predictive analytics, CryptoTracker Pro empowers users to monitor and grow their cryptocurrency portfolio effectively.",
    "size": 80,
    "reviews": "9.3k",
    "ratingAvg": 4.7,
    "downloads": "1.1M",
    "ratings": [
      { "name": "1 star", "count": 210 },
      { "name": "2 star", "count": 380 },
      { "name": "3 star", "count": 800 },
      { "name": "4 star", "count": 2400 },
      { "name": "5 star", "count": 5400 }
    ]
  },
  {
    "id": 20,
    "image": "../src/assets/20.jpg",
    "title": "PhotoLab Pro",
    "companyName": "CreativePixels",
    "description": "PhotoLab Pro is a feature-rich photo editing app designed to provide professional-grade tools for enhancing, filtering, and creating stunning visuals. It offers AI-powered effects, collage creation, advanced color correction, and layer management. Users can edit photos with precision, apply creative filters, and produce high-quality content ready for social media, prints, or professional use. PhotoLab Pro includes tutorials, templates, and export options to support creativity and productivity. Its user-friendly interface, combined with intelligent automation and advanced features, makes it suitable for both beginners and professionals looking to elevate their photo editing skills effortlessly. The app emphasizes creativity, control, and efficient workflow, ensuring users achieve remarkable results every time.",
    "size": 110,
    "reviews": "11.4k",
    "ratingAvg": 4.8,
    "downloads": "1.5M",
    "ratings": [
      { "name": "1 star", "count": 220 },
      { "name": "2 star", "count": 350 },
      { "name": "3 star", "count": 700 },
      { "name": "4 star", "count": 2500 },
      { "name": "5 star", "count": 8100 }
    ]
  }
]
